OpenFoam/Breast_gland/Case2_groovy/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantSimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          0.01;

writeControl    timeStep;

writeInterval   25;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

libs ("libOpenFoam.so" "libgroovyBC.so"); // for groovyBC

functions
{
    temparature
    {
        type            probes;
        functionObjectLibs ("libsampling.so");
        writeControl   timeStep;
        writeInterval  10;
        probeLocations
        (
            ( 0 0.042 0)
            ( 0 0.052 0 )
            ( 0 0.062 0)
            (0 0.072 0)
        );
        fields
        (
            T
        );
    }
}


// ************************************************************************* //
