OpenFoam/Breast_gland/Case2_groovy/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0) // 0
    (0.072 0 0) // 1
    (0 0.072 0) // 2
    (0 0 0.01) //3
    (0.072 0 0.01) //4
    (0 0.072 0.01) //5

);

blocks
(
    hex (0 1 2 0 3 4 5 3) gland (50 50 1) simpleGrading (1 1 1) // 0
);

edges
(
arc 1 2 (0.05 0.05 0)
arc 4 5 (0.05 0.05 0.01)
);

boundary
(
    Bottom
    {
        type wall;
        faces
        (
            (0 1 4 3)
        );
    }
    circumference
    {
        type wall;
        faces
        (
            (1 2 4 5)
        );
    }
    left
    {
        type symmetryPlane;
        faces
        (
            (2 0 3 5)
        );
    }
   ahead
    {
	type empty;
	faces
	(
	    (0 1 2 0)
	);
    }
   behind
   {
	type empty;
	faces
	(
	    (3 4 5 3)
	);
   }
);
mergePatchPairs
(
);

// ************************************************************************* //
