OpenFoam/Breast_gland/Case2_groovy/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       46000;
    }
    heat
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       46400;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       46500;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       46800;
    }
    left
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          800;
        startFace       47600;
    }
    ahead
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          800;
        startFace       48400;
    }
    behind
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       49200;
    }
)

// ************************************************************************* //
