OpenFoam/Breast_gland/Case2_groovy/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

heatSource
{
	type		scalarSemiImplicitSource;
	active		true;

	scalarSemiImplicitSourceCoeffs
	{
		selectionMode	cellZone;
		cellZone	gland;
		volumeMode	specific;
		injectionRateSuSp
		{
			T  (700 0);
		}
	}
}

// ************************************************************************* //
