OpenFoam/Breast_gland/Case2_groovy/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    Bottom
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }

    circumference
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }

    left
    {
        type            symmetryPlane;
    }

    ahead
    {
	type		empty;
    }

    behind
    {
        type           empty;
    }
}

// ************************************************************************* //
