OpenFoam/Breast_gland/Case2_groovy/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    
    Bottom
    {
        type            fixedValue;
	value		uniform 310;
    }

    circumference
    {
        type            groovyBC;
        variables       "htot = 10.0; Tinf = 294.0; k = 0.48;";
	valueExpression	"Tinf";
	fractionExpression "1.0/(1.0 + k/(mag(delta())*htot))"; // Based on convection heat transfer discretization
	value		294;
    }

    left
    {
        type            symmetryPlane;
    }
    
    ahead
    {
	type		empty;
    }

    behind
    {
	type		empty;
    }
}

// ************************************************************************* //
